# ExternalResourceMatchOptions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceMatchOptions Properties
ExternalResourceMatchOptions Class See Also
---
The ExternalResourceMatchOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ResourceType | The desired resource type which external resources should match. |

# See Also
ExternalResourceMatchOptions Class
Autodesk.Revit.DB Namespace